Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalModelIsIncorrect Property
 Analytical Model is not created for the structural element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AnalyticalModelIsIncorrect { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalModelIsIncorrect As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AnalyticalModelIsIncorrect {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace